#### ResetMovedBarTransform Method

---

|  |
| --- |
| RebarInSystem Class   See Also |

Reset the transformation representing the movement of the bar relative to its default position along the distribution path. The moved bar transform will be set to Identity.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public void ResetMovedBarTransform( 	int barPositionIndex ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub ResetMovedBarTransform ( _ 	barPositionIndex As Integer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void ResetMovedBarTransform( 	int barPositionIndex ) ``` |

#### Parameters

barPositionIndex
:   Type:  System Int32
     The bar index.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ]. |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions InapplicableDataException | For this RebarInSystem element individual bars can't be moved, excluded or included. |

# See Also

RebarInSystem Class

Autodesk.Revit.DB.Structure Namespace